In [4]:
import numpy as np
import pandas as pd
import seaborn as sns
import warnings

In [3]:
df_user=pd.read_csv(r'C:\Users\yagve\OneDrive\Documents\Python\Machine Learning\Project\book rental datasets\BX-Users.csv',encoding='latin-1')

C:\Users\yagve\AppData\Local\Temp\ipykernel_5692\4130389520.py:1: DtypeWarning: Columns (0) have mixed types. Specify dtype option on import or set low_memory=False.
  df_user=pd.read_csv(r'C:\Users\yagve\OneDrive\Documents\Python\Machine Learning\Project\book rental datasets\BX-Users.csv',encoding='latin-1')

In [5]:
df_user.head()

  user_id                            Location   Age
0       1                  nyc, new york, usa   NaN
1       2           stockton, california, usa  18.0
2       3     moscow, yukon territory, russia   NaN
3       4           porto, v.n.gaia, portugal  17.0
4       5  farnborough, hants, united kingdom   NaN

In [6]:
df_user.isnull().sum()

user_id          0
Location         1
Age         110763
dtype: int64

In [7]:
df_user['Age'].fillna(df_user['Age'].mean(),inplace=True)

In [10]:
df_user['Location'].fillna("NA",inplace=True)

In [11]:
df_books=pd.read_csv(r'C:\Users\yagve\OneDrive\Documents\Python\Machine Learning\Project\book rental datasets\BX-Books.csv',encoding='latin-1')

C:\Users\yagve\AppData\Local\Temp\ipykernel_5692\1869633697.py:1: DtypeWarning: Columns (3) have mixed types. Specify dtype option on import or set low_memory=False.
  df_books=pd.read_csv(r'C:\Users\yagve\OneDrive\Documents\Python\Machine Learning\Project\book rental datasets\BX-Books.csv',encoding='latin-1')

In [12]:
df_books.head()

,isbn,book_title,book_author,year_of_publication,publisher
0,195153448,Classical Mythology,Mark P. O. Morford,2002,Oxford University Press
1,2005018,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada
2,60973129,Decision in Normandy,Carlo D'Este,1991,HarperPerennial
3,374157065,Flu: The Story of the Great Influenza Pandemic...,Gina Bari Kolata,1999,Farrar Straus Giroux
4,393045218,The Mummies of Urumchi,E. J. W. Barber,1999,W. W. Norton &amp; Company

In [16]:
df_books.shape

(271379, 5)

In [17]:
df_books.isnull().sum()

isbn                   0
book_title             0
book_author            1
year_of_publication    0
publisher              2
dtype: int64

In [18]:
df_books.dropna(inplace=True)

In [19]:
df_book_rating=pd.read_csv(r'C:\Users\yagve\OneDrive\Documents\Python\Machine Learning\Demo Datasets\BX-Book-Ratings.csv',encoding='latin-1',nrows=10000)

In [20]:
df_book_rating.head()

   user_id        isbn  rating
0   276725  034545104X       0
1   276726   155061224       5
2   276727   446520802       0
3   276729  052165615X       3
4   276729   521795028       6

In [21]:
df=pd.merge(df_book_rating,df_books,on='isbn')

In [22]:
df

,user_id,isbn,rating,book_title,book_author,year_of_publication,publisher
0,276725,034545104X,0,Flesh Tones: A Novel,M. J. Rose,2002,Ballantine Books
1,276726,155061224,5,Rites of Passage,Judith Rae,2001,Heinle
2,276727,446520802,0,The Notebook,Nicholas Sparks,1996,Warner Books
3,278418,446520802,0,The Notebook,Nicholas Sparks,1996,Warner Books
4,276729,052165615X,3,Help!: Level 1,Philip Prowse,1999,Cambridge University Press
...,...,...,...,...,...,...,...
8696,243,385720106,7,A Map of the World,Jane Hamilton,1999,Anchor Books/Doubleday
8697,243,425092917,0,The Accidental Tourist,Anne Tyler,1994,Berkley Publishing Group
8698,243,425098834,0,If Morning Ever Comes,Anne Tyler,1983,Berkley Publishing Group
8699,243,425163407,9,Unnatural Exposure,Patricia Daniels Cornwell,1998,Berkley Publishing Group
8700,243,425164403,0,Only Love (Magical Love),Erich Segal,1998,Berkley Publishing Group

In [26]:
n_users=df['user_id'].nunique()

In [27]:
n_books=df['isbn'].nunique()

In [31]:
dic=dict(enumerate(df['isbn'].unique().flatten()))

In [36]:
def map_isbn(x):
    y=list(dic.values()).index(x)
    return y

In [37]:
df['isbn_id']=df['isbn'].map(map_isbn)

In [39]:
df.head()

,user_id,isbn,rating,book_title,book_author,year_of_publication,publisher,isbn_id
0,276725,034545104X,0,Flesh Tones: A Novel,M. J. Rose,2002,Ballantine Books,0
1,276726,155061224,5,Rites of Passage,Judith Rae,2001,Heinle,1
2,276727,446520802,0,The Notebook,Nicholas Sparks,1996,Warner Books,2
3,278418,446520802,0,The Notebook,Nicholas Sparks,1996,Warner Books,2
4,276729,052165615X,3,Help!: Level 1,Philip Prowse,1999,Cambridge University Press,3

In [40]:
dic1=dict(enumerate(df['user_id'].unique().flatten()))

In [41]:
def map_userid(x):
    y=list(dic1.values()).index(x)
    return y

In [43]:
df['user_id_order']=df['user_id'].map(map_userid)

In [44]:
df.head()

,user_id,isbn,rating,book_title,book_author,year_of_publication,publisher,isbn_id,user_id_order
0,276725,034545104X,0,Flesh Tones: A Novel,M. J. Rose,2002,Ballantine Books,0,0
1,276726,155061224,5,Rites of Passage,Judith Rae,2001,Heinle,1,1
2,276727,446520802,0,The Notebook,Nicholas Sparks,1996,Warner Books,2,2
3,278418,446520802,0,The Notebook,Nicholas Sparks,1996,Warner Books,2,3
4,276729,052165615X,3,Help!: Level 1,Philip Prowse,1999,Cambridge University Press,3,4

In [46]:
df1=df[['user_id_order','isbn_id', 'rating', 'book_title', 'book_author',
       'year_of_publication', 'publisher','isbn','user_id']]

In [47]:
df1.head()

,user_id_order,isbn_id,rating,book_title,book_author,year_of_publication,publisher,isbn,user_id
0,0,0,0,Flesh Tones: A Novel,M. J. Rose,2002,Ballantine Books,034545104X,276725
1,1,1,5,Rites of Passage,Judith Rae,2001,Heinle,155061224,276726
2,2,2,0,The Notebook,Nicholas Sparks,1996,Warner Books,446520802,276727
3,3,2,0,The Notebook,Nicholas Sparks,1996,Warner Books,446520802,278418
4,4,3,3,Help!: Level 1,Philip Prowse,1999,Cambridge University Press,052165615X,276729

In [48]:
from sklearn.model_selection import train_test_split
df1_train,df1_test=train_test_split(df1,test_size=0.3)

In [49]:
train_data_matrix=np.zeros((n_users,n_books))
for line in df1_train.itertuples():
    train_data_matrix[line[1]-1,line[2]-1]=line[3]

In [50]:
train_data_matrix

array([[5., 0., 0., ..., 0., 0., 0.],
       [0., 0., 0., ..., 0., 0., 0.],
       [0., 0., 0., ..., 0., 0., 0.],
       ...,
       [0., 0., 0., ..., 0., 0., 0.],
       [0., 0., 0., ..., 0., 0., 0.],
       [0., 0., 0., ..., 0., 0., 0.]])

In [52]:
from sklearn.metrics import pairwise_distances
user_similarity=pairwise_distances(test_data_matrix,metric='cosine')
item_similarity=pairwise_distances(test_data_matrix.T,metric='cosine')

In [53]:
def predict(ratings,similarity,type='user'):
    if type=='user':
        mean_user_rating=ratings.mean(axis=1)
        ratings_diff=(ratings-mean_user_rating[:,np.newaxis])
        pred=mean_user_rating[:,np.newaxis]+similarity.dot(ratings_diff)/np.array([np.abs(similarity).sum(axis=1)]).T
    elif type=='item':
        pred=ratings.dot(similarity)/np.array([np.abs(similarity).sum(axis=1)])
    return pred

In [54]:
item_prediction=predict(train_data_matrix,item_similarity,type='item')
user_prediction=predict(train_data_matrix,user_similarity,type='user')

In [55]:
from sklearn.metrics import mean_squared_error
from math import sqrt
def rms(prediction,ground_truth):
    prediction=prediction[ground_truth.nonzero()].flatten()
    ground_truth=ground_truth[ground_truth.nonzero()].flatten()
    return sqrt(mean_squared_error(prediction,ground_truth))

In [56]:
rms(user_prediction,train_data_matrix)

7.679616708848812